Repository: mozilla-l10n/mt-training-data
Catalog: mki/mki_pontoon.tmx
Source language: en_us
Languages: mki

source: Want to help make Common Voice even better? Great! Get in touch via email or <discourseLink>Discourse</discourseLink> forums, submit site issues via <githubLink>GitHub</githubLink>, or join the <matrixLink>Matrix</matrixLink> community chat.
mki: عام آواز نا به بهتر ٺائڻ ۾ مدد ڪرڻ چاهيو ٿا؟ زبردست! اي ميل ذريعي رابطو ڪرو يا <discourseLink>Discourse</discourseLink> فورمز، سائيٽ ري مسئلن ۾ <githubLink>GitHub</githubLink> ذريعي جمع ڪريو، يا شامل ٿيو <matrixLink>Matrix</matrixLink> ڪميونٽي چيٽ.

source: Want to save your information? <createProfile>Create a profile</createProfile>
mki: اوھان ري معلومات محفوظ ڪرڻ چاھو ٿا؟ <createProfile>پروفائل ٺاھو</createProfile>

source: Want to stay in touch with Common Voice?
mki: عام آواز سان رابطي ۾ رهڻ چاهو ٿا؟

source: Watch our video explainer to help
mki: مدد لاءِ اسان ري وڊيو وضاحت ڪندڙ ڏيکو

source: We are going out to get a coffee.
mki: اسان ٻاهر جاون ڀيا ڪافي ليڻ لاءِ.

source: We are going out to get coffee.
mki: اسي ڪافي وٺڻ لاءِ ٻاهر وڃي رهيا آهيون.

source: Website Localization
mki: ويب سائيٽ Localization

source: We couldn’t get any audio clips for you to listen to. Please try again later.
mki: اسان اوهانن ا سڻون لاءِ ڪي به آڊيو ڪلپس حاصل نه ڪري سگها ھان. مهرباني ڪري بعد ۾ ٻيهر ڪوشش ڪريو.

source: We couldn’t get any sentences for you to speak. Please try again later.
mki: اسان اوهان نا ڳالهائڻ لاءِ ڪو به جملو حاصل نه ڪري سگهياھان. مهرباني ڪري ڪجھہ دير رکي واڙي ڪوشش ڪرو.

source: We launch the Common Voice site in this language.
mki: اسان اي ٻولي ۾ عام آواز ري سائيٽ شروع ڪران تا.

source: We may have run out of clips - refresh the page, or try again later.
mki: اسان وٽان شايد ڪلپس ختم ٿي گيا ھي - صفحي ري ريفريش ڪرو، يا بعد ۾ ڪوشش ڪرو.

source: We’re crowdsourcing an open-source dataset of voices. Donate your voice, validate the accuracy of other people’s clips, make the dataset better for everyone.
mki: اسان آوازن ري هڪ اوپن سورس ڊيٽا سيٽ ڪري رهيا هيان. آڀرو آواز ڏيو، ٻيجي ماڻهنا ري ڪلپس ري درستگي نا درست ڪرو، ڊيٽا سيٽ ناهر ڪنهن لاءِ بهتر ٿاو.

source: We’re going out to get coffee.
mki: اسان ٻاهر جاون ڀيا ڪافي ليڻ لاءِ.

source: We release the dataset every 3 months.
mki: اسان ڊيٽا سيٽ نا هر 3 مهيني ۾ جاري ڪران تا.

source: We're making some big changes
mki: اسان ڪجهه وڏيون تبديليون ڪران ڀيا

source: We’re sorry, your platform is not currently supported.
mki: اسان نا معاف ڪرو، اوهان رو پليٽ فارم في الحال سپورٽ ڪونه ڪري.

source: We use a Mozilla tool called <pontoonLink>Pontoon</pontoonLink> for translations. Pontoon has lots of languages, but if it doesn’t have yours you can <pontoonRequestLink>request for your language to be added</pontoonRequestLink>. Then, to make the language available on the Common Voice project, <githubRepoLink>request the new language on GitHub</githubRepoLink>. <localizationFragment>See more on site translation</localizationFragment>.
mki: اسان ترجمي لاءِ موزيلا ٽول استعمال ڪرا ٿا جڪي ۾ <pontoonLink>Pontoon</pontoonLink> ڏثو جاي تو. پونٽون ۾ ڪيي ئي ٻوليي ھي، پر جيڪڏهن او اوهان ري نه هي ته اوهان ڪري سگهو ٿا <pontoonRequestLink> آڀري ٻولي شامل ڪرڻ ري درخواست</pontoonRequestLink>. اي کان پوء، ٻولي ري عام آواز پروجيڪٽ تي دستياب ڪرڻ لاء، <githubRepoLink> GitHub تي نئين ٻولي ري درخواست ڪرو </githubRepoLink>. <localizationFragment>سائيٽ ري ترجمي تي وڌيڪ ڏيکو</localizationFragment>.

source: We've run out of sentences to record in this language...
mki: اي ٻولي ۾ رڪارڊ ڪرڻ لاءِ اسان وٽ جملا ختم ٿي گيا ھي.

source: We want speech models to be better at understanding a diverse range of speakers. For this to happen, a voice dataset must represent lots of different people.
mki: اسان چاهيون ٿا ته تقرير را ماڊل بهتر ھوئ ته ڳالهائيندڙن ري مختلف رينج نا سمجهڻ ۾. ائين ٿيڻ لاءِ، هڪ آواز ڊيٽا سيٽ نا ڪتي ئي مختلف ماڻهن ري نمائندگي ڪرڻي ڀي ٿي.

source: We want the machine learning algorithms to able to handle a variety of background noise, and even relatively loud noises can be accepted provided that they don’t prevent you from hearing the entirety of the text. Quiet background music is OK; music loud enough to prevent you from hearing each and every word is not.
mki: اسان چاهون ٿا ته مشين لرننگ الگورتھم مختلف پس منظر ري شور نا سنڀالڻ ري قابل ٿي وڃن، ۽ جيتوڻيڪ نسبتا بلند آواز قبول ڪري سگهي ٿو، بشرطيڪ هي اوهان نا متن ري مڪمل ٻڌڻ لاء روڪي نه سگنا. خاموش پس منظر موسيقي ٺيڪ هي؛ موسيقي ڪافي بلند آواز اوهان نا ٻڌڻ کان روڪڻ لاء هر ۽ هر لفظ نه هي.

source: We will be in touch with more information about how to add your language to Common Voice very soon.
mki: اسان جلد ئي آوهان ري ٻولي ري عام آواز ۾ شامل ڪري بابت وڌيڪ معلومات لا رابطو ڪرسان.

source: What is a language on Common Voice?
mki: عام آواز تي ٻولي ڪئ هي؟

source: What issues are you experiencing with this sentence?
mki: اي جملي سان اوهان ڪهڙيون مشڪلاتا محسوس ڪري رهيا هو؟

source: What needs to be in my file?
mki: منا نجي فائل ۾ ڪئ هوڻ کڀي؟

source: What sentences can I add?
mki: هون ڪهڙا جملا شامل ڪري سگهان ٿو؟

source: When a user rejects a voice clip it returns to the Queue. If rejected a second time, the voice clip is moved to the Clip Graveyard.
mki: جڏهن هيڪ صارف هيڪ وائيس ڪلپ نا رد ڪري ٿو ته او قطار ۾ واپس اي ٿي. جيڪڏهن ٻيجو ڀيرو رد ٿي ڃاي، آواز ڪلپ قبرستان ڏانهن منتقل ٿي جاسي.

source: When listening, check very carefully that what has been recorded is exactly what has been written; reject if there are even minor errors. <br />Very common mistakes include:
mki: جڏهن سڻون، تمام احتياط سان چيڪ ڪرو ته جڪو رڪارڊ ڪيري گيو هي او ئي هي جڪو لکيوڀيو هي؛ رد ڪرو جيڪڏهن اڃا به معمولي غلطيون هي. تمام عام غلطيون شامل هي:

source: Why ?
mki: ڪيريلل

source: Why are you asking?
mki: ڪريلل پڇي رهيا هو؟

source: Why Common Voice?
mki: ڪامن آواز ڪيريلا؟

source: With a profile, you can keep track of your activity and connect with a community of voice data contributors.
mki: پروفائل سان، اوھان آپري سرگرمي ري نگراني ڪري سگھوٿا ۽ آواز ڊيٽا ري مدد ڪندڙن ري ھڪڙي ڪميونٽي سان ڳنڍي سگھوٿا.

source: Write
mki: لک

source: Write options menu
mki: اوڀشن رو مينيو لکو

source: y
mki: وائي

source: Yes
mki: ھا

source: Yes, send me emails. I’d like to stay informed about the Common Voice Project.
mki: جي ها، مون کي اي ميلونا موڪلسي. ھون ڪا من وائس پروجيڪٽ لا باخبر رهڻ چاهيون ٿو.

source: You can add sentences on the <writePageLink>Write page</writePageLink> or review sentences on the <reviewPageLink>Review page</reviewPageLink>.
mki: اوھان <writePageLink>صفحو لکو</writePageLink> تي جملا شامل ڪري سگھو ٿا يا <reviewPageLink>نظرثاني صفحي</reviewPageLink> تي جمان رو جائزو وٺو.

source: You can also use Keyboard Shortcuts: { sc-review-form-button-approve-shortcut } to Approve, { sc-review-form-button-reject-shortcut } to Reject, { sc-review-form-button-skip-shortcut } to Skip
mki: اوھان ڪي بورڊ شارٽ ڪٽ پڻ استعمال ڪري سگھو ٿا: { sc-review-form-button-approve-shortcut } منظور ڪرڻ لاءِ، { sc-review-form-button-reject-shortcut } رد ڪرڻ لاءِ، { sc-review-form-button-skip-shortcut } ڇڏڻ لاءِ

source: You can go to the <datasetsPage>datasets page</datasetsPage>, select the version and language(s) you want, and download it! The files have <metadataLink>associated metadata</metadataLink>, such as demographic information and validation data. You’ll need to provide an email address to download the dataset.
mki: اوھان جاي سگھوٿا <datasetsPage>datasets صفحي</datasetsPage>، جڪو اوھان چاھيو او ورجن ۽ ٻولي چونڊو، ۽ ائ ري ڊائون لوڊ ڪرو! فائلن ۾ <metadataLink>وڙيل ميٽا ڊيٽا</metadataLink> ھي، جهڙوڪ ڊيموگرافڪ ڄاڻ ۽ تصديق واري ڊيٽا. اوهان نا ڊيٽا سيٽ ڊائون لوڊ ڪرڻ لاءِ هيڪ اي ميل پتو مهيا ڪرڻ ري ضرورت پوسي.

source: You can meet others in the Mozilla language communities by joining <discordLink>Discord</discordLink> or <discourseLink>Discourse</discourseLink> for topical conversations, or <matrixLink>Matrix</matrixLink> for quick advice.
mki: اوھان موزيلا ٻوليءَ ائ ڪميونٽيز ۾ ٻين سان ملاقات ڪري سگهو ٿا <discourseLink>Discourse</discourseLink> ۾ شامل ٿي موضوعي گفتگو لاءِ، يا <matrixLink>Matrix</matrixLink> تڪڙو مشورو حاصل ڪرڻ لاءِ.

source: You cannot add multiple sentences for a single submission
mki: وڍيڪ جملا ايڍ نٿا ڪري سڱو ھيڪ اونون را

source: You can run events to help people contribute. It’s easier than you think. You could do it online with a videoconferencing tool, or in person if it’s safe. <eventTemplate>Check out our templates and resources for running events</eventTemplate>.
mki: اوهان ماڻهن ري مدد ڪرڻ ۾ مدد ڏيڻ لاء واقعا هلائي سگهو ٿا. او اوهان ري سوچ کان وڌيڪ آسان هي. اوھان او ڪري سگھوٿا آن لائن وڊيو ڪانفرنسنگ ٽول سان، يا ذاتي طور تي جيڪڏھن او محفوظ ھي. <eventTemplate>هلندڙ واقعن لاءِ اسان را ٽيمپليٽ ۽ وسيلا چيڪ ڪرو</eventTemplate>.

source: You can <sentenceCollectorLinkAdd>add small numbers of sentences</sentenceCollectorLinkAdd>, or you can do <bulkImportDocsLink>bulk imports using Github</bulkImportDocsLink>. Remember that sentences need to be <licenseLink>CC0 (or public domain)</licenseLink>, or you can write your own.
mki: اوھان ڪري سگھو ٿا <sentenceCollectorLinkAdd>جملي را ننڍا انگ شامل ڪرو</sentenceCollectorLinkAdd>، يا اوهان ڪري سگهو ٿا <bulkImportDocsLink>Github استعمال ڪندي بلڪ درآمد</bulkImportDocsLink>. ياد رکو ته جملا <licenseLink>CC0 (يا عوامي ڊومين)</licenseLink> هجڻ گهرجن، يا اوهان آڀري لکي سگهو ٿا.

source: You can use the <scraperLink>Sentence extractor</scraperLink> to leverage short sentences from Wikipedia.
mki: اوھان استعمال ڪري سگھو ٿا <scraperLink>Sentence Extractor</scraperLink> وڪيپيڊيا مان مختصر جملن کي استعمال ڪرڻ لاءِ.

source: You could use social media platforms to get the message out. Share posts that explain why it matters, and get in touch with other people talking about issues like language rights, voice AI, or bias in tech. See more advice on <campaignLink>running a social campaign, including content you can re-use</campaignLink>.
mki: اوهان پيغام حاصل ڪرڻ لاء سوشل ميڊيا پليٽ فارم استعمال ڪري سگهو ٿا. پوسٽون شيئر ڪرو جڪي وضاحت ڪي ٿا ته او ڪئ ضروري هي، ۽ ٻين ماڻهن سان رابطي ۾ حاصل ڪرو جيڪي مسئلن بابت ڳالهائي رهيا هي، جهڙوڪ ٻولي ري حقن، آواز AI، يا ٽيڪنالاجي ۾ تعصب. وڌيڪ صلاح ڏسو <campaignLink>سماجي مهم هلائڻ، جڪي ۾ مواد اوهان ٻيهر استعمال ڪري سگهو ٿا</campaignLink>.

source: You have not selected any languages. Please go to your <profileLink>Profile</profileLink> to select languages.
mki: اوهان ڪا به ٻولي ڪون چونڊي هي. ٻولي چونڊڻ لاءِ مھرباني ڪري آپري <profileLink>Profile</profileLink> ڏانھن جاو.

source: You have reached the submission limit for this page. Please wait for { $retryLimit } minutes before submitting another sentence. Thank you for your patience!
mki: اوھان اي صفحي لاءِ جمع ڪرائڻ ري حد تائين پھچي ڱيا ھ{ $retryLimit }و. مھرباني ڪري 1 منٽ انتظار ڪريو ٻي سزا جمع ڪرڻ کان اڳ. اوهان ري صبر ري مهرباني

source: You have reached the submission limit for this page. Please wait for { $retryLimit } seconds before submitting another sentence. Thank you for your patience!
mki: اوھان اي صفحي لاءِ جمع ڪرائڻ ري حد تائين پھچي ڱيا ھو. مھرباني ڪري 1 سيڪنڍ{ $retryLimit } انتظار ڪريو ٻي سزا جمع ڪرڻ کان اڳ. اوهان ري صبر ري مهرباني

source: You must allow microphone access.
mki: اوهان نا مائڪروفون تائين رسائي ري اجازت ڏيڻ کڀي.

source: Your download has started.
mki: اوھان ري ڊائون لوڊ شروع ٿي گئ ھي.

source: You’re contributing to a target segment
mki: اوھان ھدف واري حصي ۾ حصو وٺي رھيا ھو

source: You’re contributing to our first target segment
mki: اوھان اسان ري پھرين ھدف واري حصي ۾ حصو لي رھيا ھو

source: You're going too fast. Please take a moment to review the sentence to make sure it's correct.
mki: اوهان تمام تيز ڃاو ڀيا. مهرباني ڪري هيڪ لمحو لو جملي رو جائزو ليڻ لاءِ پڪ ڪرڻ لاءِ ته او صحيح هي.

source: You're helping Common Voice reach our daily sentence goals!
mki: اوھان مدد ڪري ھي ڪمن وائس جي اسان ري روزاني جملي ري مقصدن تائين پھچڻ ۾!

source: Your language variant might be out of clips! If you’re comfortable, you can change your settings to see other sentences within your language.
mki: اوهان ري ٻولي مختلف ڪلپس کان ٻاهر ٿي سگهي ٿي! جيڪڏهن اوهان آرام سان هو، اوهان آپري سيٽنگون تبديل ڪري سگهو ٿا اوهان ري ٻولي ۾ ٻين جملنا کي ڏسڻ لاء.

source: Your language variant might be out of sentences! If you’re comfortable, you can change your settings to see other sentences within your language.
mki: اوهان ري ٻولي مختلف جملنا کان ٻاهر ٿي سگهي ٿي! جيڪڏهن اوهان آرام سان هو، اوهان پنهنجي سيٽنگون تبديل ڪري سگهو ٿا اوهان ري ٻولي ۾ ٻين جملن نا ڏسڻ لاء.

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } recording goal!
mki: اوهان اساني روزاني { $goalValue } رڪارڊنگ مقصد ري <goalPercentage></goalPercentage> تائين پهچڻ ۾ عام آواز ري مدد ڪئري هي!

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } validation goal!
mki: اوهان اساني روزاني { $goalValue } ري تصديق واري مقصد ري <goalPercentage></goalPercentage> تائين پهچڻ ۾ عام آواز ري مدد ڪئري هي!
